//Константы в верхнем регистре
/*

константы часто используются в качестве
псевдонимов для трудно запоминаемых значений
которые известны до начала исполнения скрипта.

Названия таких констант пишутся 
с использованием заглавных букв и подчёркивания.

Например, сделаем константы для различных цветов 
в «шестнадцатеричном формате»:
*/

const COLOR_RED = "#F00";
const COLOR_GREEN = "#0F0";
const COLOR_BLUE = "#00F";
const COLOR_ORANGE = "#FF7F00";

// ...когда нам нужно выбрать цвет
let color = COLOR_ORANGE;
alert(color); // #FF7F00

/*

    COLOR_ORANGE гораздо легче запомнить, чем "#FF7F00".
    Гораздо легче допустить ошибку при вводе "#FF7F00", чем при вводе COLOR_ORANGE.
    При чтении кода COLOR_ORANGE намного понятнее, чем #FF7F00.


*/

/*

Когда мы должны использовать для констант заглавные буквы, 
а когда называть их нормально? 

БОЛЬШАЯ - если константа известна до выполнения (цвета)
            (жестко закондированное значение)
обычные - если до выполнения неизвестна

*/

const pageLoadTime = /* время, потраченное на загрузку веб-страницы */;