//let message;
//message = "Hello, Anya"; //сохарнить строку

/*
переменная может быть:
-буквой
-цифрой
-содержать только знаки $ и _

-может быть не латиницей (не рекомендуется)

-не может начинаться с цифры
-не должно быть зарезервированным словом
*/


/*
скрипт  с ошибкой не запускается
ошибку можно посмотреть в браузере во вкладке console
*/

let user = "John";
let age = "25";
//let message = "Hellooo";

//var message = 'Hello';

/*
let user = "John",
    age  = 25,
    message = "Hello"; 
*/

//Мы можем изменить его столько раз, сколько захотим:

let message;

message = "Hello";
message = "Bye";

/*
объявить можно только 1 раз
а значение другое поставить много раз
*/

//скопировать данные из одной переменной в другую

let var_2 = message;


/*
let 123 = "syntax error";
alert(123);
*/


let $ = 1; // объявили переменную с именем "$"
let _ = 2; // а теперь переменную с именем "_"

//alert($ + _); // 3

//регистр имеет значение
//Переменные с именами apple и AppLE – это две разные переменные.

/*
Нелатинские буквы разрешены, но не рекомендуются

let имя = 'test';
let 我 = 'test';
*/


//константы

//константа - это неизменяемая перменная

const myBirthday = '18.04.1982';




