/*
Название переменной должно 
говорить о том, какие данные в ней хранятся
------------


Несколько хороших правил:

   - Используйте легко читаемые имена, такие как userName 
        или shoppingCart.

   - Избегайте использования аббревиатур или коротких имён, 
        таких как a, b, c, за исключением тех случаев, 
        когда вы точно знаете, что так нужно.

    - Делайте имена максимально описательными и лаконичными. 
        Примеры плохих имён: data и value. 
        Такие имена ничего не говорят. 
        Их можно использовать только в том случае, 
        если из контекста кода очевидно, какие данные 
        хранит переменная.

    - Договоритесь с вашей командой об используемых терминах. 
        Если посетитель сайта называется «user», тогда 
        мы должны называть связанные с ним переменные 
        currentUser или newUser, а не, к примеру, 
        currentVisitor или newManInTown.
*/