// Проверка логина

// Напишите код, который будет спрашивать логин с помощью prompt.

// Если посетитель вводит «Админ», то prompt запрашивает пароль, 
// если ничего не введено или нажата клавиша Esc – показать «Отменено», 
// в противном случае отобразить «Я вас не знаю».

// Пароль проверять так:

//     Если введён пароль «Я главный», то выводить «Здравствуйте!»,
//     Иначе – «Неверный пароль»,
//     При отмене – «Отменено».



let login = prompt("Кто там?", "");

if (login === "Админ"){
    let password = prompt("Пароль?", "");
    if (password === "Я главная")
    {
        alert("Привет, красотка!");
    } 
    else if (pass === "" || pass === null) 
    {
        alert( 'Отменено' );
    } 
    else 
    {
        alert( 'Неверный пароль');
    }
}
else if (login === '' || login === null) 
{
    alert( 'Отменено' );
} 
else 
{
    alert( "Вы ктио такие? Я вас не знаю!" );
}













