/*
Какие буквы (заглавные или строчные) 
использовать для имён констант?


Рассмотрим следующий код:

const birthday = '18.04.1982';

const age = someCode(birthday);

У нас есть константа birthday, а также age, 
которая вычисляется при помощи некоторого кода, 
используя значение из birthday 

Можно ли использовать заглавные буквы для имени 
birthday? А для age? Или одновременно для обеих переменных?

*/

const BIRTHDAY = '18.04.1982'; // использовать заглавные буквы?

/*
BIRTHDAY - c большой можно
т.к. дата жеско привязана
*/

const age = someCode(BIRTHDAY); // а здесь?

/*
age - нет
age вычисляется во время выполнения скрипта. 
Сегодня у нас один возраст, а через год уже совсем другой. 

Она является константой, потому что не изменяется 
при выполнении кода. Но она является «менее константной», 
чем birthday: она вычисляется, поэтому мы должны 
сохранить её в нижнем регистре.
*/