// let a = 3 + 2;

// switch (a) {
//   case 3:
//     alert( 'Маловато' );
//     break;
//   case 4:
//     alert( 'В точку!' );
//     break;
//   case 5:
//     alert( 'Перебор' );
//     break;
//   default:
//     alert( "Нет таких значений" );
// }


// let a = "1";
// let b = 0;

// switch (+a) {
//   case b + 1:
//     alert("Выполнится, т.к. значением +a будет 1, что в точности равно b+1");
//     break;

//   default:
//     alert("Это не выполнится");
// }


// Группировка «case»

// let a = 2 + 2;

// switch (a) {
//   case 4:
//     alert('Правильно!');
//     break;

//   case 3: // (*) группируем оба case
//   case 5:
//     alert('Неправильно!');
//     alert("Может вам посетить урок математики?");
//     break;

//   default:
//     alert('Результат выглядит странновато. Честно.');
// }

// Тип имеет значение

// Нужно отметить, что проверка на равенство всегда строгая. 
// Значения должны быть одного типа, чтобы выполнялось равенство.


let arg = prompt("Введите число?");
switch (arg) {
  case '0':
  case '1':
    alert( 'Один или ноль' );
    break;

  case '2':
    alert( 'Два' );
    break;

  case 3:
    alert( 'Никогда не выполнится!' );
    break;
  default:
    alert( 'Неизвестное значение' );
}











