// alert( 2 > 1 );  // true (верно)
// alert( 2 == 1 ); // false (неверно)
// alert( 2 != 1 ); // true (верно)


// let res = 10 < 5;
// alert(res);

// let test = "vasya" > "va";
// alert(test); 

//Сравнение строк

//строки сравниваются посимвольно

// alert( 'Я' > 'А' ); // true
// alert( 'Коты' > 'Кода' ); // true
// alert( 'Сонный' > 'Сон' ); // true

// alert( 'A' > 'B' ); // false

//Используется кодировка Unicode, а не настоящий алфавит


//строчная "а" больше заглавной "А"

//Сравнение разных типов
//При сравнении значений разных типов JavaScript 
// приводит каждое из них к числу.



alert( '2' > 1 ); // true, строка '2' становится числом 2
alert( '01' == 1 ); // true, строка '01' становится числом 1















