//переходы
//метки

// Уже понятно из названия, для чего они предназначаются - 
// для перехода из одной части кода в другую


// Например, инструкция break заставляет интерпретатор перейти 
// к другой инструкции, 

// а инструкция continue посылает интерпретатор 
// в начало цикла, тем самым пропускается оставшаяся часть кода, 
// которая следует за continue. 

//метки
// Любая инструкция может быть помечена идентификатором, 
// за которым следует двоеточие.


// Идентификатор: инструкция;

// Инструкцию имеет смысл помечать, если у нее есть тело, 
// следовательно, это условная инструкция или цикл. 

// Потом эти метки можно использовать в инструкциях break и continue, 
// это единственные две инструкции, которые могут взаимодействовать с метками.

// mai: while (выражение) {
//     // тут что-то
//     continue mai;
//     // и тут что-то
// }









