//Цикл «while»

// while(condition){
  // код
  // также называемый "телом цикла"
  //   Код из тела цикла выполняется, пока условие condition истинно.
// }

// цикл ниже выводит i, пока i < 3

// let i = 0;
// while (i < 10){ // выводит 0, затем 1, затем 2
//     alert( i );
//     i++;
// }

// let i = 10;
// while (i) { // когда i будет равно 0, условие станет ложным, и цикл остановится
//   alert( i );
//   i--;
// }

//Цикл «do…while»

//Проверку условия можно разместить под телом цикла, и
// спользуя специальный синтаксис do..while:

// do {
//     //cycle body
// } while (condition);

// Цикл сначала выполнит тело, а затем проверит условие condition, 
// и пока его значение равно true, он будет выполняться снова и снова.

// let i = 0;
// do {
//     alert(i);
//     i++;
// } while (i < 3);

// Такая форма синтаксиса оправдана, если вы хотите, чтобы тело цикла 
// выполнилось хотя бы один раз, даже если условие окажется ложным. 
// На практике чаще используется форма с предусловием: while(…) {…}.


//for
// for (начало; условие; шаг) {
//     // ... тело цикла ...
//   }


// for (let i = 0; i < 3; i++) { // выведет 0, затем 1, затем 2
//   alert(i);
// }


